In [1]:
#using Dataframe.transform() function to multiply 6.28 to each element in the dataframe.
import pandas as pd

In [4]:
df = pd.DataFrame({"A":[12, 4, 5, None, 1], "B":[7, 2, 54, 3, None],
                   "C":[20, 16, 11, 3, 8], "D":[14, 3, None, 2, 6]})

index = ['Row 1', 'Row 2', 'Row 3', 'Row 4', 'Row 5']

df.index = index

df

          A     B   C     D
Row 1  12.0   7.0  20  14.0
Row 2   4.0   2.0  16   3.0
Row 3   5.0  54.0  11   NaN
Row 4   NaN   3.0   3   2.0
Row 5   1.0   NaN   8   6.0

In [6]:
result = df.transform(func = lambda x : x * 6.28)
result

           A       B       C      D
Row 1  75.36   43.96  125.60  87.92
Row 2  25.12   12.56  100.48  18.84
Row 3  31.40  339.12   69.08    NaN
Row 4    NaN   18.84   18.84  12.56
Row 5   6.28     NaN   50.24  37.68